Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/vocational_education_and_training/post_leaving_certificate_courses.html.txt.tmx
Source language: en
Languages: ga

source: If you have finished your secondary education and would like to develop vocational and technological skills in order to get a job or to go into further education and training, the Post-Leaving Certificate (PLC) course may be the one you are looking for
ga: Má tá do chuid oideachais méanscolaíochta críochnaithe agat, agus go dtaitneodh leat scileanna teicneolaíochta agus gairmeacha a fhorbairt, chun post a fháil nó chun dul níos faide san oideachais agus traenáil, b'fhéidir gurb é an Cúrsa Iar Ard-Teistiméireachta (CIAT) atá á lorg agat

source: The PLC is often seen just as a course for school-leavers. In fact, you will be also welcomed as an adult participant
ga: Ceapann a lán daoine gur cúrsa é seo le haghaidh daoine atá ag fágail na scoile ach i ndáirire tá fáilte roimh dhaoine fásta

source: A participant contribution of €200 per year (pdf) is charged for PLC students
ga: Beidh muirear rannphairtíochta €200 in aghaidh na bliana (pdf) le n-íoc i leith cúrsaí CIAT ón bhliain 2011/2012 amach

source: There are some exemptions to this contribution - see 'Rates' below
ga: Tá díolúintí on mhuirear seo i gcásanna áirithe - féach 'Rátaí' thíos

source: PLC courses take place in schools, colleges and community education centres
ga: Bíonn na cúrsaí Iar Ard-Teistiméireachta seo ar siúl sna scoileanna, coláistí agus ionaid oideachais phobail ar fud na tíre

source: The courses are full-time and last for one to two years
ga: Is cúrsaí lán-aimsearatha iad a sheasann idir bliain agus dhá bhliain

source: They offer a mixture of practical work, academic work and work experience
ga: Tairiscíonn siad meascán de obair phraiticiúil, obair acadúil, agus taithí oibre

source: They are designed as a step towards skilled employment and, as such, they are closely linked to industry and its needs
ga: Ceapadh iad mar choiscéim i dtreo fostaíocht oillte agus, dhá bhrí sin, tá siad nascaithe go dlúth le tionsclaíocht agus a cuid riachtanaisí

source: Post Leaving Certificate courses adopt an integrated approach, focusing on technical knowledge, core skills and work experience
ga: Tá cur chuige comhtháite ag cúrsaí Iar Ardteistiméireachta, a dhíríonn ar eolas teicniúil, bunscileanna agus taithí oibre

source: Almost half of the time spent on these courses is devoted to knowledge and skill training related to employment, with a further quarter spent on relevant work-based experience
ga: Caitear beagnach leath den am ar na cúrsaí seo ag plé le traenáil eolais agus scileanna a bhaineann le fostaíocht, caitear ceathrú eile den am le taithí chuí oibre

source: Most PLC courses are delivered by Education and Training Boards (ETBs)
ga: Is iad na Boird Oideachais agus Oiliúna (BOO) a chuireann an cuid is mó de na cúrsaí iar ardteistiméireachta ar fáil

source: A wide range of disciplines are covered including business, electronics engineering, computing, catering, sport and leisure, theatre and stage, performance art, art craft and design, equestrian studies, multi-media studies, journalism, tourism, marketing, childcare and community care, hairdressing and beauty care, applied science, horticulture etc
ga: Tá réimse leathan ábhar dhá chlúdach ina measc tá, Gnó, Innealtóireacht Leictreonacha, Ríomhaireacht, Lónadóireacht, Spórt agus Siamsaíocht, Amharclann agus Stáitse, Ealaín Léirithe, Ealaín, Ceardaíocht agus Dearadh, Staidéir na nEach, Staidéir Ilmheán, Iriseoireacht, Turasóireacht, Margaíocht, Cúram Leanaí agus Cúram Pobail, Gruagaireacht agus Cúram Áilleachta, Eolaíocht Fheidhmeach, Gairneoireacht

source: See 'How to apply' below for a link to Qualifax, the national learners' database, where you can search for PLC courses
ga: Féach 'Conas iarratas a dhéanamh' thíos

source: The qualification you receive at the end of your training will depend on the type of course you have chosen
ga: Braitheann an cháilíocht a bheas agat ag deireadh do chuid traenáil ar an gcinéal cúrsa a rinne tú

source: Many of the 1-year PLC courses offer Quality and Qualifications Ireland (QQI) accreditation at level 5 on the National Framework of Qualifications, while other more advanced courses may offer QQI level 6, which can lead to further studies at third level
ga: Tairiscíonn go leor da na cúrsaí bliana seo creidiúint ó Dearbhú Cáilíochta agus Cáilíochtaí Éireann (DCCE) ag leibhéal 5 ar an gCreat Náisiúnta Cáilíochtaí (CNC), cé go dtairiscíonn cuid eile creidiúint DCCE ag leibhéal 6, a d'fhéadfadh duine a stiurú chun níos mó staidéir ag an triú leibhéal a dhéanamh

source: Other qualifications such as City and Guilds are also available
ga: Tá cáilíochtaí eile mar CITY AND GUILDS ar fáil chomh maith

source: It is important to check out the qualification attached to a particular course before you decide to enrol
ga: Tá sé tábhachtach go seiceálfadh tú an cháilíocht a bhaineann le cúrsa, sula gcláraíonn tú ann

source: Changes to Vocational Educational Committees (VECs)
ga: Boird Oideachais agus Oiliúna

source: Since 1 July 2013, Education and Training Boards (ETBs) replaced Vocational Educational Committees (VECs)
ga: Ó 1 Iúil 2013, cuirfear Boird Oideachais agus Oiliúna (BOO) in áit coistí gairmoideachais

source: All services provided by VECs will continue to be provided by ETBs
ga: Aistrítear ionaid oiliúna FÁS chuig BOO freisin

source: In general, you should have finished your secondary education and taken your Leaving Certificate examination in order to be eligible for a PLC course
ga: Go ginearálta, ba cheart go mbeadh scrúdú na hArdteistiméireachta déanta agat agus tú críochnaithe le oideachas na meán scoile, chun a bheith i dteideal cúrsa Iar Ardteistiméireachta

source: However, if you have work experience relevant to the course on offer or think you can demonstrate a particular ability in that area, you should write to the college where the course will take place
ga: Má tá taithí oibre cuí agat don chúrsa atá dá thairiscint áfach, agus go bhfuil ábaltacht agat sa réimse sin, ba cheart duit scríobh chuig an coláiste ina bhfuil na cúrsaí ar siúl

source: Explain your circumstances in the letter and ask to meet the co-ordinator of the course
ga: Mínigh do chás i litir agus labhair le comhordanóir an chúrsa

source: You may be eligible for a means-tested student grant or a Back to Education Allowance, depending on your circumstances
ga: B'fhéidir go mbeidh tú i dteideal Liúntas um Fhilleadh ar Oideachas nó deontas cothabhála a fháil - braitheann sé ar do chúinsí féin

source: Our document on Grants for students in further and higher education describes who qualifies for a grant and how to apply
ga: Déanann ár ndoiciméad ar dheontais chothabhála cur síos ar na rialacha agus ar chonas iarratas a dhéanamh

source: Up to the academic year 2011/2012, Irish nationals and nationals of other EU member states did not have to pay tuition fees for approved PLC courses
ga: Roimh an bhliain 2011/2012, níor gá do shaoránaigh Éireannacha ná do shaoránaigh an Aontais Eorpaigh táillí a íoc i leith cúrsaí Iar Ardteistiméireachta

source: Some other categories of students were also entitled to access them free of fees - see studentfinance.ie for details
ga: D'fhéadadh catagóirí eile mac léinn freastal orthu saor ó tháillí freisin - féach ar studentfinance.ie

source: A participant contribution of €200 per year was introduced in the academic year 2011/2012
ga: Beidh muirear rannphairtíochta €200 in aghaidh na bliana le n-íoc i leith cúrsaí CIAT ón bhliain 2011/2012 amach

source: You do not have to pay the contribution if:
ga: Ní gá duit an muirear seo a íoc má:

source: • You hold a full medical card in your own right
ga: • Tá láncharta leighis agat féin

source: • You are the dependent child of a full medical card holder
ga: • Is páiste clethiúnach tú le duine a bhfuil láncharta leighis aige/aici

source: • You are eligible for a student grant
ga: • Tá tú i dteideal díolúíne a fháil faoin Scéim um Dheontais Chothabhála maoinithe do mhic léinn a dhéanann freastal ar chúrsaí Iar-Ardteistiméireachta

source: • You are getting Back to Education Allowance or a VTOS allowance
ga: • Tá tú ag fáil Liúntas um Fhilleadh ar Oideachas nó Liúntas faoin Scéim Deiseanna Oiliúna Gairmoideachais

source: Colleges offering PLC courses usually also have a 'course charge' to cover such expenses as books, uniforms, student services, professional registration fees and exam fees
ga: Gearrann gach coláiste muirear chúrsa freisin, de ghnáth

source: The amount varies from college to college
ga: Braitheann méid an mhuirir seo ar an gcoláiste féin

source: Students who are exempted from the participant contribution will still have to pay the course charge
ga: Beidh ort an muirear chúrsa a íoc, fiú má fuair tú díolúine ón mhuirear rannphairtíochta

source: Use the national learners' database qualifax.ie to find the course in which you are most interested. Apply directly to the school or college offering that course
ga: Faigh an cúrsa a bhfuil suim agat ann agus déan d'iarratas díreach chuig an scoil nó coláiste ina bhfuil na cúrsaí ar siúl

source: Because the courses are work-related, you will probably be called for an interview before a final selection is made
ga: De bhrí go bhfuil na cúrsaí seo bunaithe ar obair, is dóigh go nglaofar ort chuig agallamh sula ndéantar an roghnú deireanach

source: These interviews are often quite informal and offer you the opportunity to discuss your particular interest in the course
ga: Is iondúil go mbíonn na hagallaimh seo neamh-fhoirmiúil agus go dtugann siad seans duit do chuid tuairimí a chuir in iúl dóibh
